Core/src/InformationRegisters/КатегорииНовостейИнтервалыВерсий/КатегорииНовостейИнтервалыВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КатегорииНовостейИнтервалыВерсий</name>
  <dimensions>
    <name>Новость</name>
    <type>
      <types>CatalogRef.Новости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияНовостей</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КатегорииНовостей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияОТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/КатегорииНовостейИнтервалыВерсий/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если ВРег(ТекущаяЗапись.КатегорияНовостей.Код) = ВРег("ProductVersion")
				ИЛИ ВРег(ТекущаяЗапись.КатегорияНовостей.Код) = ВРег("PlatformVersion") Тогда
			// Все нормально.
		Иначе
			// Нестандартная категория.
			// Ошибку не выдавать - оставить как есть.
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		Если ВРег(ТекущаяЗапись.КатегорияНовостей.Код) = ВРег("ProductVersion")
			ИЛИ ВРег(ТекущаяЗапись.КатегорияНовостей.Код) = ВРег("PlatformVersion") Тогда
			// Все нормально.
		Иначе
			// Нестандартная категория.
			// Ошибку не выдавать - оставить как есть.
		КонецЕсли;
	КонецЦикла;

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Вызывается автоматически только из формы, при программной записи необходимо вызывать явно.
	ОбработкаПроверкиЗаполнения(Отказ, Новый Массив);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для каждого ТекущаяЗапись Из ЭтотОбъект Цикл
		// 1. Для категории "ProductVersion" проверять формат: 99.99.999.9999.
		// 2. Для категории "PlatformVersion" проверять формат: 99.99.999.9999.
		Если ВРег(ТекущаяЗапись.КатегорияНовостей.Код) = ВРег("ProductVersion")
				ИЛИ ВРег(ТекущаяЗапись.КатегорияНовостей.Код) = ВРег("PlatformVersion") Тогда
			// Проверка формата версий: только цифры, формат 99.99.999.9999.
			// Версия ОТ.
			ТекстСообщения = НСтр("ka='ვერსიის მნიშვნელობის ფორმატი (%ВерсияОТ%) უნდა იყოს 99.99.999.9999 %ПодробныйТекстОшибки%.';ru='Формат значения версии ОТ (%ВерсияОТ%) должен быть 99.99.999.9999 %ПодробныйТекстОшибки%.';en='Value Format version FROM (% VersiyaOT%) should be 99.99.999.9999% PodrobnyyTekstOshibki%.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВерсияОТ%", ТекущаяЗапись.ВерсияОТ);
			ПроверитьВерсию(ТекущаяЗапись.ВерсияОТ, ТекстСообщения, Отказ);
			// Версия ДО.
			ТекстСообщения = НСтр("ka='ვერსიის მნიშვნელობის ფორმატი (%ВерсияДО%) უნდა იყოს 99.99.999.9999 %ПодробныйТекстОшибки%.';ru='Формат значения версии ДО (%ВерсияДО%) должен быть 99.99.999.9999 %ПодробныйТекстОшибки%.';en='Value Format version to (% VersiyaDO%) should be 99.99.999.9999% PodrobnyyTekstOshibki%.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВерсияДО%", ТекущаяЗапись.ВерсияДО);
			ПроверитьВерсию(ТекущаяЗапись.ВерсияДО, ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверяет строку версии на формат 99.99.999.9999 и в случае несоответствия выдает ошибку.
//
// Параметры:
//  ВерсияСтрокой  - Строка;
//  ТекстСообщения - Строка;
//  Отказ          - Булево.
//
Процедура ПроверитьВерсию(ВерсияСтрокой, ТекстСообщения, Отказ)

	ВсеЦифры = ИнтернетПоддержкаПользователейКлиентСервер.ВсеЦифры();

	МассивСловВерсии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ВерсияСтрокой, ".");
	Если МассивСловВерсии.Количество() = 4 Тогда // 99.99.999.9999
		Для СловоВерсии=0 По МассивСловВерсии.Количество()-1 Цикл
			Если СловоВерсии=0 Тогда // 2 цифры
				Если СтрДлина(МассивСловВерсии[СловоВерсии]) <> 2 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ТекстСообщения;
					Сообщение.Текст = СтрЗаменить(
						Сообщение.Текст,
						"%ПодробныйТекстОшибки%",
						"(первое число версии %ВерсияСтрокой% должно быть длиной 2 символа)");
					Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
					Сообщение.УстановитьДанные(ЭтотОбъект);
					Сообщение.Сообщить();
					Отказ = Истина;
					ВызватьИсключение Сообщение.Текст;
				Иначе // Только цифры?
					Для С=1 По СтрДлина(МассивСловВерсии[СловоВерсии]) Цикл
						ТекущийСимвол = Сред(МассивСловВерсии[СловоВерсии], С, 1);
						Если Найти(ВсеЦифры, ТекущийСимвол) = 0 Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = ТекстСообщения;
							Сообщение.Текст = СтрЗаменить(
								Сообщение.Текст,
								"%ПодробныйТекстОшибки%",
								"(первое число версии %ВерсияСтрокой% должно содержать только цифры, а найден символ " + ТекущийСимвол + ")");
							Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
							Сообщение.УстановитьДанные(ЭтотОбъект);
							Сообщение.Сообщить();
							Отказ = Истина;
							ВызватьИсключение Сообщение.Текст;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли СловоВерсии=1 Тогда // 2 цифры
				Если СтрДлина(МассивСловВерсии[СловоВерсии]) <> 2 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ТекстСообщения;
					Сообщение.Текст = СтрЗаменить(
						Сообщение.Текст,
						"%ПодробныйТекстОшибки%",
						"(второе число версии %ВерсияСтрокой% должно быть длиной 2 символа)");
					Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
					Сообщение.УстановитьДанные(ЭтотОбъект);
					Сообщение.Сообщить();
					Отказ = Истина;
					ВызватьИсключение Сообщение.Текст;
				Иначе // Только цифры?
					Для С=1 По СтрДлина(МассивСловВерсии[СловоВерсии]) Цикл
						ТекущийСимвол = Сред(МассивСловВерсии[СловоВерсии], С, 1);
						Если Найти(ВсеЦифры, ТекущийСимвол) = 0 Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = ТекстСообщения;
							Сообщение.Текст = СтрЗаменить(
								Сообщение.Текст,
								"%ПодробныйТекстОшибки%",
								"(второе число версии %ВерсияСтрокой% должно содержать только цифры, а найден символ " + ТекущийСимвол + ")");
							Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
							Сообщение.УстановитьДанные(ЭтотОбъект);
							Сообщение.Сообщить();
							Отказ = Истина;
							ВызватьИсключение Сообщение.Текст;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли СловоВерсии=2 Тогда // 3 цифры
				Если СтрДлина(МассивСловВерсии[СловоВерсии]) <> 3 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ТекстСообщения;
					Сообщение.Текст = СтрЗаменить(
						Сообщение.Текст,
						"%ПодробныйТекстОшибки%",
						"(третье число версии %ВерсияСтрокой% должно быть длиной 3 символа)");
					Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
					Сообщение.УстановитьДанные(ЭтотОбъект);
					Сообщение.Сообщить();
					Отказ = Истина;
					ВызватьИсключение Сообщение.Текст;
				Иначе // Только цифры?
					Для С=1 По СтрДлина(МассивСловВерсии[СловоВерсии]) Цикл
						ТекущийСимвол = Сред(МассивСловВерсии[СловоВерсии], С, 1);
						Если Найти(ВсеЦифры, ТекущийСимвол) = 0 Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = ТекстСообщения;
							Сообщение.Текст = СтрЗаменить(
								Сообщение.Текст,
								"%ПодробныйТекстОшибки%",
								"(третье число версии %ВерсияСтрокой% должно содержать только цифры, а найден символ " + ТекущийСимвол + ")");
							Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
							Сообщение.УстановитьДанные(ЭтотОбъект);
							Сообщение.Сообщить();
							Отказ = Истина;
							ВызватьИсключение Сообщение.Текст;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли СловоВерсии=3 Тогда // 4 цифры
				Если СтрДлина(МассивСловВерсии[СловоВерсии]) <> 4 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ТекстСообщения;
					Сообщение.Текст = СтрЗаменить(
						Сообщение.Текст,
						"%ПодробныйТекстОшибки%",
						"(четвертое число версии %ВерсияСтрокой% должно быть длиной 4 символа)");
					Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
					Сообщение.УстановитьДанные(ЭтотОбъект);
					Сообщение.Сообщить();
					Отказ = Истина;
					ВызватьИсключение Сообщение.Текст;
				Иначе // Только цифры?
					Для С=1 По СтрДлина(МассивСловВерсии[СловоВерсии]) Цикл
						ТекущийСимвол = Сред(МассивСловВерсии[СловоВерсии], С, 1);
						Если Найти(ВсеЦифры, ТекущийСимвол) = 0 Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = ТекстСообщения;
							Сообщение.Текст = СтрЗаменить(
								Сообщение.Текст,
								"%ПодробныйТекстОшибки%",
								"(четвертое число версии %ВерсияСтрокой% должно содержать только цифры, а найден символ " + ТекущийСимвол + ")");
							Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
							Сообщение.УстановитьДанные(ЭтотОбъект);
							Сообщение.Сообщить();
							Отказ = Истина;
							ВызватьИсключение Сообщение.Текст;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Текст = СтрЗаменить(
			Сообщение.Текст,
			"%ПодробныйТекстОшибки%",
			"(должно быть 4 числа версии, а не " + МассивСловВерсии.Количество() + " как в %ВерсияСтрокой%)");
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%ВерсияСтрокой%", ВерсияСтрокой);
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		ВызватьИсключение Сообщение.Текст;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
